# FamilySizeTable Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilySizeTable Methods
FamilySizeTable Class See Also
---
The FamilySizeTable type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AsValueString | Gets the table cell value as a string. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetColumnHeader | Gets a column of the table at at given index. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsValidColumnIndex | Checks if the column index is valid. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace